Ran Plan for project: `repository` dir: `etc/terraform/repository` workspace: `repository`

<details><summary>Show Output</summary>

```diff
Initializing modules...

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 3.0"...
- Installing hashicorp/aws v3.75.2...
- Installed hashicorp/aws v3.75.2 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.


Warning: Provider aws.main is undefined

  on main.tf line 7, in module "ecr_repository":
   7:     aws.main = aws

Module module.ecr_repository does not declare a provider named aws.main.
If you wish to specify a provider configuration for the module, add an entry
for aws.main in the required_providers block within the module.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Downloading git::git@github.com:holaluz/kraken.git for ecr_repository...
- ecr_repository in .terraform/modules/ecr_repository/aws/ecr


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.ecr_repository.aws_ecr_lifecycle_policy.this will be created
+ resource "aws_ecr_lifecycle_policy" "this" {
+       id          = (known after apply)
+       policy      = jsonencode(
            {
+               rules = [
+                   {
+                       action       = {
+                           type = "expire"
                        }
+                       description  = "Keep last X images"
+                       rulePriority = 1
+                       selection    = {
+                           countNumber = 30
+                           countType   = "imageCountMoreThan"
+                           tagStatus   = "any"
                        }
                    },
                ]
            }
        )
+       registry_id = (known after apply)
+       repository  = "dragonite"
    }

  # module.ecr_repository.aws_ecr_repository.this will be created
+ resource "aws_ecr_repository" "this" {
+       arn                  = (known after apply)
+       id                   = (known after apply)
+       image_tag_mutability = "MUTABLE"
+       name                 = "dragonite"
+       registry_id          = (known after apply)
+       repository_url       = (known after apply)
+       tags                 = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = ""
+           "Name"        = "dragonite"
+           "Owner"       = "onefees"
+           "Resource"    = "ecr-repository"
        }
+       tags_all             = {
+           "Application" = "dragonite"
+           "Deployment"  = "terraform"
+           "Environment" = (known after apply)
+           "Name"        = "dragonite"
+           "Owner"       = "onefees"
+           "Resource"    = "ecr-repository"
        }

+       image_scanning_configuration {
+           scan_on_push = true
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Provider aws.main is undefined
│ 
│   on main.tf line 7, in module "ecr_repository":
│    7:     aws.main = aws
│ 
│ Module module.ecr_repository does not declare a provider named aws.main.
│ If you wish to specify a provider configuration for the module, add an
│ entry for aws.main in the required_providers block within the module.
╵

  % Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0100   171  100    16  100   155    390   3786 --:--:-- --:--:-- --:--:--  4275
{"status": "ok"}
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p repository`
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p repository`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
